<?php
// *   Аўтар: "БуслікДрэў" ( http://buslikdrev.by/ )
// *   © 2016-2020; BuslikDrev - Усе правы захаваныя.
// *   Спецыяльна для сайта: "OpenCart.pro" ( http://opencart.pro/ )

// Heading
$_['heading_title']                         = '<b>Зручний Редактор <span style="color:limegreen">Full</span></b> v1.0';

// Tab
$_['tab_blog_category']                     = 'Налаштування категорій блогу';
$_['tab_blog_article']                      = 'Налаштування статей блогу';
$_['tab_category']                          = 'Налаштування категорій товару';
$_['tab_information']                       = 'Налаштування інформаційних сторінок';
$_['tab_manufacturer']                      = 'Налаштування виробників';
$_['tab_product']                           = 'Налаштування товару';
$_['tab_universal']                         = 'Універсальні настройки';
$_['tab_other']                             = 'Загальні настройки';

// Text
$_['text_extension']                        = 'Розширення';
$_['text_module']                           = 'Модулі';
$_['text_edit']                             = 'Редагування';
$_['text_install']                          = 'Установка модуля...';
$_['text_uninstall']                        = 'Видалення модуля...';
$_['text_uninstall_files']                  = 'Видалення файлів модуля...';
$_['text_uninstall_files_log']              = 'Звіт про видалення файлів модуля';
$_['text_ocmod_clear']                      = 'Чистка модифікаторів...';
$_['text_ocmod_clearlog']                   = 'Чистка балки модифікаторів...';
$_['text_ocmod_refresh']                    = 'Оновлення модифікаторів...';
$_['text_cache_clear']                      = 'Чистка кэшу...';
$_['text_width']                            = 'Ширина';
$_['text_height']                           = 'Висота';
$_['text_after']                            = 'Після';
$_['text_before']                           = 'До';
$_['text_replace']                          = 'Замінити';
$_['text_left']                             = 'Зліва';
$_['text_right']                            = 'Справа';
$_['text_top']                              = 'Зверху';
$_['text_bottom']                           = 'Знизу';
$_['text_left_top']                         = 'У лівому верхньому кутку';
$_['text_right_top']                        = 'У правому верхньому куті';
$_['text_left_bottom']                      = 'У лівому нижньому кутку';
$_['text_right_bottom']                     = 'У правому нижньому кутку';
$_['text_example']                          = '<b>Наприклад:</b> %s';
$_['text_view']                             = '<b>Шаблон розташований по шляху:</b> catalog/view/theme/%s/template/';
$_['text_author']                           = 'Автор: <a href="http://buslikdrev.by/" title="Ізделія ремісничого проізводства" target="_blank">БуслікДрев</a>. Тих. підтримка: <a href="https://liveopencart.ru/buslikdrev" title="Техніческая допомогу щодо вирішення проблем пов\'язані з модулем" target="_blank">ТУТ</a>. Тема підтримки: <a href="http://forum.opencart.pro/topic/6294-удобный-редактор-convenient-editor/" title="Техніческая допомогу щодо вирішення проблем пов\'язані з модулем" target="_blank">ТУТ</a>.';
$_['text_corp']                             = '© 2016-' . date('d.m.Y') . '; <a href="http://buslikdrev.by/" title="BuslikDrev" target="_blank">BuslikDrev</a> - Всі права збережені.';

// Entry
$_['entry_index']                           = 'Пропустити повторні';
$_['entry_position']                        = 'Розташування';
$_['entry_href_status']                     = 'Статус кнопки';
$_['entry_href_search']                     = 'Прив\'язка кнопки до коду';
$_['entry_href_add']                        = 'Код кнопки';
$_['entry_href_admin']                      = 'Посилання на адмін панель';
$_['entry_status']                          = 'Статус';

// Help
$_['help_index']                            = 'За замовчуванням 0 - означає не пропускати, а вибрати перший знайдений php або html код.';
$_['help_blog_category_href_status']        = 'Якщо так, то кнопка швидкого редагування буде включена на сторінці категорії блогу.';
$_['help_blog_article_href_status']         = 'Якщо так, то кнопка швидкого редагування буде включена на сторінці статті блогу.';
$_['help_category_href_status']             = 'Якщо так, то кнопка швидкого редагування буде включена на сторінці категорії товару.';
$_['help_information_href_status']          = 'Якщо так, то кнопка швидкого редагування буде включена на інформаційній сторінці.';
$_['help_manufacturer_href_status']         = 'Якщо так, то кнопка швидкого редагування буде включена на сторінці виробника.';
$_['help_product_href_status']              = 'Якщо так, то кнопка швидкого редагування буде включена на сторінці товару.';
$_['help_href_search']                      = 'Прив\'язка кнопки до коду. Неправильно написаний код може вивести помилку! Якщо не впевнені, що робити - залиште поле порожнім.';
$_['help_href_add']                         = 'Код кнопки. Неправильно написаний код може вивести помилку! Якщо не впевнені, що робити - залиште поле порожнім.';
$_['help_href_admin']                       = 'Вкажіть внутрішню або зовнішню посилання адмін панелі для кнопки швидкого редагування товару, якщо змінювали назву папки на сервері, наприклад: \'adminka/\' або \'https://site.by/adminka/\'. За замовчуванням: \'admin/\'.';

//Button
$_['button_files_clear']                    = 'Видалити також файли модуля? - якщо немає, просто оновіть сторінку від гріха. Звіт про видалення файлів дивіться в логах модифікаторів.';

// Error
$_['error_permission']                      = 'У вас недостатньо прав для внесення змін!';
$_['error_warning']                         = 'Уважно перевірте форму на помилки!';
$_['error_install']                         = 'Нешта пайшло не так!';
$_['error_uninstall']                       = 'Нешта пайшло не так!';
$_['error_uninstall_pro']                   = '<b>Увага!</b> Модуль є частиною збірки OpenCart.Pro і не може бути знищено повністю!';
$_['error_name']                            = 'Назва повинна містити від 3 до 64 символів!';
$_['error_width']                           = 'Вкажіть Ширину!';
$_['error_height']                          = 'Вкажіть Висоту!';
$_['error_max_input_vars']                  = '<b>Увага! Буде перевищений ліміт параметра %s</b>, якщо перевищити, дані можуть не зберегтися. Збільште значення на сервері або зверніться з цим проханням до хостера для збільшення ліміту.<br>Ліміт на сервері: %s<br>Ліміт від модуля: %s - відсічення %s, щоб уникнути втрати даних<br>Поточне значення: ';

// Success
$_['success_install']                       = ' - успішно встановлений!';
$_['success_uninstall']                     = ' - успішно вилучено!';
$_['success_uninstall_data_base']           = '◄ База даних видалена ►: ';
$_['success_uninstall_modification']        = '◄ Модифікатор видалений ►: ';
$_['success_uninstall_folder']              = '◄ Папка видалена тому файлів немає ►: ';
$_['success_uninstall_file']                = '◄ Файл видалений ►: ';
$_['success_setting']                       = 'Налаштування успішно змінено!';
$_['success_setting_apply']                 = 'Налаштування успішно застосовані!';
$_['success_setting_save']                  = 'Налаштування успішно збережені!';
$_['success_setting_new']                   = 'Новий модуль успішно доданий!';
$_['success_setting_redirect']              = 'Ви були перенаправлені на потрібну сторінку налаштувань!';