<?php
// *   Аўтар: "БуслікДрэў" ( http://buslikdrev.by/ )
// *   © 2016-2020; BuslikDrev - Усе правы захаваныя.
// *   Спецыяльна для сайта: "OpenCart.pro" ( http://opencart.pro/ )

// Heading
$_['heading_title']                         = '<b>Удобный Редактор <span style="color:limegreen">Full</span></b> v1.0';

// Tab
$_['tab_blog_category']                     = 'Настройки категорий блога';
$_['tab_blog_article']                      = 'Настройки статей блога';
$_['tab_category']                          = 'Настройки категорий товара';
$_['tab_information']                       = 'Настройки информационных страниц';
$_['tab_manufacturer']                      = 'Настройки производителей';
$_['tab_product']                           = 'Настройки товара';
$_['tab_universal']                         = 'Универсальные настройки';
$_['tab_other']                             = 'Общие настройки';

// Text
$_['text_extension']                        = 'Расширения';
$_['text_module']                           = 'Модули';
$_['text_edit']                             = 'Редактирование';
$_['text_install']                          = 'Установка модуля...';
$_['text_uninstall']                        = 'Удаление модуля...';
$_['text_uninstall_files']                  = 'Удаление файлов модуля...';
$_['text_uninstall_files_log']              = 'Отчёт об удалении файлов модуля';
$_['text_ocmod_clear']                      = 'Чистка модификаторов...';
$_['text_ocmod_clearlog']                   = 'Чистка лога модификаторов...';
$_['text_ocmod_refresh']                    = 'Обновление модификаторов...';
$_['text_cache_clear']                      = 'Чистка кэша...';
$_['text_width']                            = 'Ширина';
$_['text_height']                           = 'Высота';
$_['text_after']                            = 'После';
$_['text_before']                           = 'До';
$_['text_replace']                          = 'Заменить';
$_['text_left']                             = 'Слева';
$_['text_right']                            = 'Справа';
$_['text_top']                              = 'Сверху';
$_['text_bottom']                           = 'Снизу';
$_['text_left_top']                         = 'В левом верхнем углу';
$_['text_right_top']                        = 'В правом верхнем углу';
$_['text_left_bottom']                      = 'В левом нижнем углу';
$_['text_right_bottom']                     = 'В правом нижнем углу';
$_['text_example']                          = '<b>Например:</b> %s';
$_['text_view']                             = '<b>Шаблон расположен по пути:</b> catalog/view/theme/%s/template/';
$_['text_author']                           = '';
$_['text_corp']                             = '© 2016-' . date('d.m.Y') . '; <a href="https://liveopencart.ru/buslikdrev" title="BuslikDrev" rel="noreferrer noopener" target="_blank">BuslikDrev</a> - Все права сохранены.';

// Entry
$_['entry_index']                           = 'Пропустить повторные';
$_['entry_position']                        = 'Расположение';
$_['entry_href_status']                     = 'Статус кнопки';
$_['entry_href_search']                     = 'Привязка кнопки к коду';
$_['entry_href_add']                        = 'Код кнопки';
$_['entry_href_admin']                      = 'Ссылка на админ панель';
$_['entry_status']                          = 'Статус';

// Help
$_['help_index']                            = 'По умолчанию 0 - означает не пропускать, а выбрать первый найденный php или html код.';
$_['help_blog_category_href_status']        = 'Если да, то кнопка быстрого редактирования будет включена на странице категории блога.';
$_['help_blog_article_href_status']         = 'Если да, то кнопка быстрого редактирования будет включена на странице статьи блога.';
$_['help_category_href_status']             = 'Если да, то кнопка быстрого редактирования будет включена на странице категории товара.';
$_['help_information_href_status']          = 'Если да, то кнопка быстрого редактирования будет включена на информационной странице.';
$_['help_manufacturer_href_status']         = 'Если да, то кнопка быстрого редактирования будет включена на странице производителя.';
$_['help_product_href_status']              = 'Если да, то кнопка быстрого редактирования будет включена на странице товара.';
$_['help_href_search']                      = 'Привязка кнопки к коду. Неправильно написанный код может вывести ошибку! Если не уверены, что делать - оставьте поле пустым.';
$_['help_href_add']                         = 'Код кнопки. Неправильно написанный код может вывести ошибку! Если не уверены, что делать - оставьте поле пустым.';
$_['help_href_admin']                       = 'Укажите внутреннюю или внешнюю ссылку админ панели для кнопки быстрого редактирования товара, если изменяли название папки на сервере, например: \'adminka/\' или \'https://site.by/adminka/\'. По умолчанию: \'admin/\'.';

//Button
$_['button_files_clear']                    = 'Удалить также файлы модуля? - если нет, просто обновите страницу от греха. Отчёт об удалении файлов смотрите в логах модификаторов.';

// Error
$_['error_permission']                      = 'У вас недостаточно прав для внесения изменений!';
$_['error_warning']                         = 'Внимательно проверьте форму на ошибки!';
$_['error_install']                         = 'Нешта пайшло не так!';
$_['error_uninstall']                       = 'Нешта пайшло не так!';
$_['error_uninstall_pro']                   = '<b>Внимание!</b> Модуль является частью сборки OpenCart.Pro и не может быть удалён полностью!';
$_['error_name']                            = 'Название должно содержать от 3 до 64 символов!';
$_['error_width']                           = 'Укажите Ширину!';
$_['error_height']                          = 'Укажите Высоту!';
$_['error_max_input_vars']                  = '<b>Внимание! Будет превышен лимит параметра %s</b>, если превысить, данные могут не сохраниться. Увеличьте значение на сервере или обратитесь с данной просьбой к хостеру для увеличения лимита.<br>Лимит на сервере: %s <br>Лимит от модуля: %s - отсечка %s во избежание потери данных<br>Текущее значение: ';

// Success
$_['success_install']                       = ' - успешно установлен!';
$_['success_uninstall']                     = ' - успешно удалён!';
$_['success_uninstall_data_base']           = '◄ База данных удалена ►: ';
$_['success_uninstall_modification']        = '◄ Модификатор удалён ►: ';
$_['success_uninstall_folder']              = '◄ Папка удалена т.к. файлов нет ►: ';
$_['success_uninstall_file']                = '◄ Файл удалён ►: ';
$_['success_setting']                       = 'Настройки успешно изменены!';
$_['success_setting_apply']                 = 'Настройки успешно применены!';
$_['success_setting_save']                  = 'Настройки успешно сохранены!';
$_['success_setting_new']                   = 'Новый модуль успешно добавлен!';
$_['success_setting_redirect']              = 'Вы были перенаправлены на нужную страницу настроек!';
