<?php
// *   Аўтар: "БуслікДрэў" ( http://buslikdrev.by/ )
// *   © 2016-2020; BuslikDrev - Усе правы захаваныя.
// *   Спецыяльна для сайта: "OpenCart.pro" ( http://opencart.pro/ )

// Heading
$_['heading_title']                         = '<b>Зручны Рэдактар <span style="color:limegreen">Full</span></b> v1.0';

// Tab
$_['tab_blog_category']                     = 'Налады катэгорый блога';
$_['tab_blog_article']                      = 'Налады артыкулаў блога';
$_['tab_category']                          = 'Налады катэгорый тавару';
$_['tab_information']                       = 'Налады інфармацыйных старонак';
$_['tab_manufacturer']                      = 'Налады вытворцаў';
$_['tab_product']                           = 'Налады тавару';
$_['tab_universal']                         = 'Універсальныя налады';
$_['tab_other']                             = 'Агульныя наладкі';

// Text
$_['text_extension']                        = 'Пашырэньні';
$_['text_module']                           = 'Модулі';
$_['text_edit']                             = 'Рэдагаванне';
$_['text_install']                          = 'Усталёўка модуля...';
$_['text_uninstall']                        = 'Выдаленне модуля...';
$_['text_uninstall_files']                  = 'Выдаленне файлаў модуля...';
$_['text_uninstall_files_log']              = 'Справаздача аб выдаленні файлаў модуля';
$_['text_ocmod_clear']                      = 'Чыстка мадыфікатараў...';
$_['text_ocmod_clearlog']                   = 'Чыстка лога мадыфікатараў...';
$_['text_ocmod_refresh']                    = 'Абнаўленьнне мадыфікатараў...';
$_['text_cache_clear']                      = 'Чыстка кэша...';
$_['text_width']                            = 'Шырыня';
$_['text_height']                           = 'Вышыня';
$_['text_after']                            = 'Пасля';
$_['text_before']                           = 'Да';
$_['text_replace']                          = 'Замяніць';
$_['text_left']                             = 'Злева';
$_['text_right']                            = 'Справа';
$_['text_top']                              = 'Зверху';
$_['text_bottom']                           = 'Знізу';
$_['text_left_top']                         = 'У левым верхнім куце';
$_['text_right_top']                        = 'У правым верхнім куце';
$_['text_left_bottom']                      = 'У левым ніжнім куце';
$_['text_right_bottom']                     = 'У правым ніжнім куце';
$_['text_example']                          = '<b>Напрыклад:</b> %s';
$_['text_view']                             = '<b>Шаблон размешчаны па шляху:</b> catalog/view/theme/%s/template/';
$_['text_author']                           = 'Аўтар: <a href="http://buslikdrev.by/" title="Вырабы рамеснай вытворчасці" target="_blank">БуслікДрэў</a>. Тэх. падтрымка: <a href="https://liveopencart.ru/buslikdrev" title="Тэхнічная дапамога па вырашэнні праблем звязаныя з модулем" target="_blank">ТУТ</a>. Тэма падтрымкі: <a href="http://forum.opencart.pro/topic/6294-удобный-редактор-convenient-editor/" title="Тэхнічная дапамога па вырашэнні праблем звязаныя з модулем" target="_blank">ТУТ</a>.';
$_['text_corp']                             = '© 2016-' . date('d.m.Y') . '; <a href="http://buslikdrev.by/" title="BuslikDrev" target="_blank">BuslikDrev</a> - Усе правы захаваны.';

// Entry
$_['entry_index']                           = 'Прапусціць паўторныя';
$_['entry_position']                        = 'Размяшчэнне';
$_['entry_href_status']                     = 'Статус кнопкі';
$_['entry_href_search']                     = 'Прывязка кнопкі да кода';
$_['entry_href_add']                        = 'Код кнопкі';
$_['entry_href_admin']                      = 'Спасылка на адмін панэль';
$_['entry_status']                          = 'Статус';

// Help
$_['help_index']                            = 'Па змаўчанню 0 - азначае не прапускаць, а выбраць першы знойдзены php або html код.';
$_['help_blog_category_href_status']        = 'Калі так, то кнопка хуткага рэдагавання будзе ўключана на старонцы катэгорыі блога.';
$_['help_blog_article_href_status']         = 'Калі так, то кнопка хуткага рэдагавання будзе ўключана на старонцы артыкулы блога.';
$_['help_category_href_status']             = 'Калі так, то кнопка хуткага рэдагавання будзе ўключана на старонцы катэгорыі тавару.';
$_['help_information_href_status']          = 'Калі так, то кнопка хуткага рэдагавання будзе ўключана на інфармацыйнай старонцы.';
$_['help_manufacturer_href_status']         = 'Калі так, то кнопка хуткага рэдагавання будзе ўключана на старонцы вытворцы.';
$_['help_product_href_status']              = 'Калі так, то кнопка хуткага рэдагавання будзе ўключана на старонцы тавару.';
$_['help_href_search']                      = 'Прывязка кнопкі да кода. Няправільна напісаны код можа вывесці памылку! Калі не ўпэўненыя, што рабіць - пакіньце поле пустым.';
$_['help_href_add']                         = 'Код кнопкі. Няправільна напісаны код можа вывесці памылку! Калі не ўпэўненыя, што рабіць - пакіньце поле пустым.';
$_['help_href_admin']                       = 'Пазначце ўнутраную або знешнюю спасылку адмін панэлі для кнопкі хуткага рэдагавання тавару, калі змянялі назву тэчкі на серверы, напрыклад: \'adminka/\' або \'https://site.by/adminka/\'. Па змаўчанню: \'admin/\'.';

//Button
$_['button_files_clear']                    = 'Выдаліць таксама файлы модуля? - калі няма, проста абновіце старонку ад граху. Справаздача аб выдаленні файлаў глядзіце ў логах мадыфікатараў.';

// Error
$_['error_permission']                      = 'У вас недастаткова правоў для ўнясення змяненняў!';
$_['error_warning']                         = 'Уважліва праверце форму на памылкі!';
$_['error_install']                         = 'Нешта пайшло не так!';
$_['error_ninstall']                        = 'Нешта пайшло не так!';
$_['error_uninstall_pro']                   = '<b>Увага!</b> Модуль з\'яўляецца часткай зборкі OpenCart.Pro і не можа быць выдалены цалкам!';
$_['error_name']                            = 'Назва павінна ўтрымліваць ад 3 да 64 знакаў!';
$_['error_width']                           = 'Пазначце Шырыню!';
$_['error_height']                          = 'Пазначце Вышыню!';
$_['error_max_input_vars']                  = '<b>Увага! Будзе перавышаны ліміт параметру %s</b>, калі перавысіць, дадзеныя могуць не захавацца. Павялічце значэнне на серверы або звярніцеся з дадзенай просьбай да хостеру для павелічэння ліміту.<br>Ліміт на сэрвэру: %s <br>Ліміт ад модуля: %s - адсечка %s каб пазбегнуць страты дадзеных<br>Бягучы значэнне: ';

// Success
$_['success_install']                       = ' - паспяхова ўсталявана!';
$_['success_uninstall']                     = ' - паспяхова выдалены!';
$_['success_uninstall_data_base']           = '◄ База дадзеных выдаленая ►: ';
$_['success_uninstall_modification']        = '◄ Мадыфікатар выдалены ►: ';
$_['success_uninstall_folder']              = '◄ Папка выдаленая бо файлаў няма ►: ';
$_['success_uninstall_file']                = '◄ Файл выдалены ►: ';
$_['success_setting']                       = 'Налады паспяхова зменены!';
$_['success_setting_apply']                 = 'Налады паспяхова ужытыя!';
$_['success_setting_save']                  = 'Налады паспяхова захаваны!';
$_['success_setting_new']                   = 'Новы модуль паспяхова дададзены!';
$_['success_setting_redirect']              = 'Вы былі перанакіраваны на патрэбную старонку налад!';